---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericGlossiness
source: html/46df2762-40c2-8919-0c5f-220a6892a83e.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericGlossiness Property

The property labeled "Glossiness" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericGlossiness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.